In [2]:
import pandas as pd
import numpy as np

In [3]:
cars_data= pd.read_csv('Cars_Data.csv')

In [4]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 432 entries, 0 to 431
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Make         428 non-null    object
 1   Model        428 non-null    object
 2   Type         428 non-null    object
 3   Origin       428 non-null    object
 4   DriveTrain   428 non-null    object
 5   MSRP         428 non-null    object
 6   Invoice      428 non-null    object
 7   EngineSize   428 non-null    float64
 8   Cylinders    426 non-null    float64
 9   Horsepower   428 non-null    float64
 10  MPG_City     428 non-null    float64
 11  MPG_Highway  428 non-null    float64
 12  Weight       428 non-null    float64
 13  Wheelbase    428 non-null    float64
 14  Length       428 non-null    float64
dtypes: float64(8), object(7)
memory usage: 50.8+ KB

In [5]:
cars_data.head()

,Make,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
0,Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265.0,17.0,23.0,4451.0,106.0,189.0
1,Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200.0,24.0,31.0,2778.0,101.0,172.0
2,Acura,TSX 4dr,Sedan,Asia,Front,"$26,990","$24,647",2.4,4.0,200.0,22.0,29.0,3230.0,105.0,183.0
3,Acura,TL 4dr,Sedan,Asia,Front,"$33,195","$30,299",3.2,6.0,270.0,20.0,28.0,3575.0,108.0,186.0
4,Acura,3.5 RL 4dr,Sedan,Asia,Front,"$43,755","$39,014",3.5,6.0,225.0,18.0,24.0,3880.0,115.0,197.0

In [6]:
cars_data['Model'] = cars_data['Model'].astype['float64']

TypeError: 'method' object is not subscriptable

Get Count of bytes a Column

In [ ]:
cars_data['Make'].nbytes

In [ ]:
cars_data["Make"].astype("category").nbytes

In [ ]:
hua = cars_data

In [ ]:
hua.head()

NameError: name 'hua' is not defined

In [ ]:
print(np.unique(hua['Model']))

In [ ]:
hua.info()

In [ ]:
print(np.unique("length"))

In [ ]:
print(np.unique(hua["Weight"]))

In [ ]:
# hua["Weight"].replace(['nan',5,inplace=True])

In [ ]:
hua.isnull.sum()

In [ ]:
hua.isnull().sum()

In [ ]:
hua.info()

In [ ]:
hua.head()

In [ ]:
hua.head()

In [ ]:
hua.head(2)

In [ ]:
hua['Invoice'] = hua["Invoice"].astype["float64"]

## We want to change our Column Invoice to:
    if price is < 15000:
        Low
    elif pirce is <30000 > 15000:
        Midumn
    else:
        High

In [ ]:
for i in (0,len(hua['Invoice']),1):
    if(hua['Invoice'][i] < 15000):
        hua['Invoice'][i] = "Low"
    elif(hua['Invoice'][i] > 15000 and hua['Invoice'][i]< 30000):
        hua['Invoice'][i] = "Medium"
    else:
        hua['Invoice'][i] = "High"

In [ ]:
hua.info()

In [ ]:
hua.isnull().sum()

In [ ]:
too = pd.read_csv('titanic_train.csv')

In [ ]:
tot.head()

In [ ]:
tot.isnull().sum()

##Change the Sex Column by for loop

I want to change the value of Column sex to man and woman insted of 0 and 1,

In [ ]:
tot.head()

In [ ]:
for i in (1,len(tot['Sex']),1):
    if(tot['Sex'][i] == 'male'):
        tot['Sex'][i] = 1
    else:
        tot['Sex'][i] = 0

In [ ]:
tot = too.copy()

NameError: name 'too' is not defined

In [ ]:

tot.head()

In [ ]:
def myfunctin(value):
    val_converted = value*12
    return val_converted

In [ ]:
tot["month_live"] = myfunctin(tot['Age'])
tot["month_live"] = round(tot["month_live"],)
tot.head()

In [ ]:
tot.head()

NameError: name 'tot' is not defined

In [8]:
data = pd.read_csv("titanic_train.csv",index_col=0,na_values="??,???")

In [9]:
tot = data.copy()

In [ ]:
tot.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#Finding the Frequecny of Data
 - for this purpose we use the Crosstab function

In [ ]:
pd.crosstab(index=tot["Sex"],columns='count',dropna=True)

col_0   count
Sex
female    314
male      577

#Findeing the Number of men Die and Women die


 - for this purpose we use the tow way Table crosstabFunction

In [ ]:
pd.crosstab(
    index=tot["Survived"],
    columns=tot["Sex"],
    dropna=True)

Sex       female  male
Survived
0             81   468
1            233   109

In [11]:
pd.crosstab(index=tot["Sex"],columns=tot['Survived'],dropna=True)

Survived    0    1
Sex
female     81  233
male      468  109

#in this Step we can use the jointProbablity for knowing that how much men die or women die in percentage;

In [12]:
pd.crosstab(index=tot["Sex"],columns=tot['Survived'],normalize=True,dropna=True)

Survived         0         1
Sex
female    0.090909  0.261504
male      0.525253  0.122334

### in this step we want to know precent of men catagory die or live and woment catagory die or live

In [13]:
pd.crosstab(index=tot["Sex"],columns=tot["Survived"],margins=True,dropna=True,normalize=True)

Survived         0         1       All
Sex
female    0.090909  0.261504  0.352413
male      0.525253  0.122334  0.647587
All       0.616162  0.383838  1.000000

###  in this Step we want to know how much will have probiblity that a person live and men or other case...
- and we use the conditional probiblity and change the value of normalize to index.

In [14]:
pd.crosstab(index=tot['Sex'],columns=tot['Survived'],margins=True,dropna=True,normalize='index')

Survived         0         1
Sex
female    0.257962  0.742038
male      0.811092  0.188908
All       0.616162  0.383838

In [15]:
pd.crosstab(index=tot['Sex'],columns=tot["Survived"],margins=True,dropna=True,normalize='columns')

Survived         0         1       All
Sex
female    0.147541  0.681287  0.352413
male      0.852459  0.318713  0.647587

In [10]:
tot.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C